SoCXin/CH32V203/IAP/M0/3_Device/MM32L06xx_s/Include/reg_usb.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_usb.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_USB_H
#define __REG_USB_H

// Files includes

#include <stdint.h>
#include <stdbool.h>
#include "types.h"




#if defined ( __CC_ARM )
#pragma anon_unions
#endif










////////////////////////////////////////////////////////////////////////////////
/// @brief USB Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define USB_BASE                    (APB1PERIPH_BASE + 0x5C00)              ///< Base Address: 0x40005C00




////////////////////////////////////////////////////////////////////////////////
/// @brief USB Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 TOP;                                                               ///< Top Register                                   offset: 0x00
    __IO u32 INT_STATE;                                                         ///< Interrupt State Register                       offset: 0x04
    __IO u32 EP_INT_STATE;                                                      ///< Endpoint Interrupt State Register              offset: 0x08
    __IO u32 EP0_INT_STATE;                                                     ///< EP0 Interrupt State Register                   offset: 0x0C
    __IO u32 INT_EN;                                                            ///< Interrupt Enable Register                      offset: 0x10
    __IO u32 EP_INT_EN;                                                         ///< Endpoint Interrupt Enable Register             offset: 0x14
    __IO u32 EP0_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x18
    __IO u32 RESERVED0;                                                         ///< Reserved                                       offset: 0x1C
    __IO u32 EP1_INT_STATE;                                                     ///< EP1 Interrupt State Register                   offset: 0x20
    __IO u32 EP2_INT_STATE;                                                     ///< EP2 Interrupt State Register                   offset: 0x24
    __IO u32 EP3_INT_STATE;                                                     ///< EP3 Interrupt State Register                   offset: 0x28
    __IO u32 EP4_INT_STATE;                                                     ///< EP4 Interrupt State Register                   offset: 0x2C
    __IO u32 RESERVED1;                                                         ///< Reserved                                       offset: 0x30
    __IO u32 RESERVED2;                                                         ///< Reserved                                       offset: 0x34
    __IO u32 RESERVED3;                                                         ///< Reserved                                       offset: 0x38
    __IO u32 RESERVED4;                                                         ///< Reserved                                       offset: 0x3C
    __IO u32 EP1_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x40
    __IO u32 EP2_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x44
    __IO u32 EP3_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x48
    __IO u32 EP4_INT_EN;                                                        ///< EP0 Interrupt Enable Register                  offset: 0x4C
    __IO u32 RESERVED5;                                                         ///< Reserved                                       offset: 0x50
    __IO u32 RESERVED6;                                                         ///< Reserved                                       offset: 0x54
    __IO u32 RESERVED7;                                                         ///< Reserved                                       offset: 0x58
    __IO u32 RESERVED8;                                                         ///< Reserved                                       offset: 0x5C
    __IO u32 ADDR;                                                              ///< USB Address Register                           offset: 0x60
    __IO u32 EP_EN;                                                             ///< Endpoint Enable Register                       offset: 0x64
    __IO u32 EP_DMA_DIR;                                                        ///< Endpoint DMA Direction Register                offset: 0x68
    __IO u32 EP_TYPE;                                                           ///< Endpoint Type Register                         offset: 0x6C
    __IO u32 EP_INDEX1_2;                                                       ///< EP Index 1_2 register                          offset: 0x70
    __IO u32 EP_INDEX3_4;                                                       ///< EP Index 3_4 register                          offset: 0x74
    __IO u32 TOG_CTRL1_4;                                                       ///< Toggle Control Register                        offset: 0x78

    __IO u32 TOG_STST1_4;                                                       ///< Toggle State Register                          offset: 0x7C

    __IO u32 SETUP0;                                                            ///< SETUP Packet Byte 0 Register                   offset: 0x80
    __IO u32 SETUP1;                                                            ///< SETUP Packet Byte 1 Register                   offset: 0x84
    __IO u32 SETUP2;                                                            ///< SETUP Packet Byte 2 Register                   offset: 0x88
    __IO u32 SETUP3;                                                            ///< SETUP Packet Byte 3 Register                   offset: 0x8C
    __IO u32 SETUP4;                                                            ///< SETUP Packet Byte 4 Register                   offset: 0x90
    __IO u32 SETUP5;                                                            ///< SETUP Packet Byte 5 Register                   offset: 0x94
    __IO u32 SETUP6;                                                            ///< SETUP Packet Byte 6 Register                   offset: 0x98
    __IO u32 SETUP7;                                                            ///< SETUP Packet Byte 7 Register                   offset: 0x9C
    __IO u32 PAKET_SIZEL;                                                       ///< DMA Max Packet Size 0 Register                 offset: 0xA0
    __IO u32 PAKET_SIZEH;                                                       ///< DMA Max Packet Size 1 Register                 offset: 0xA4
    __IO u32 RESERVED9;                                                         ///< Reserved                                       offset: 0xA8
    __IO u32 RESERVED10;                                                        ///< Reserved                                       offset: 0xAC

    __IO u32 RESERVED11;                                                        ///< Reserved                                       offset: 0xB0
    __IO u32 RESERVED12;                                                        ///< Reserved                                       offset: 0xB4
    __IO u32 RESERVED13;                                                        ///< Reserved                                       offset: 0xB8
    __IO u32 RESERVED14;                                                        ///< Reserved                                       offset: 0xBC
    __IO u32 RESERVED15;                                                        ///< Reserved                                       offset: 0xC0
    __IO u32 RESERVED16;                                                        ///< Reserved                                       offset: 0xC4
    __IO u32 RESERVED17;                                                        ///< Reserved                                       offset: 0xC8
    __IO u32 RESERVED18;                                                        ///< Reserved                                       offset: 0xCC
    __IO u32 RESERVED19;                                                        ///< Reserved                                       offset: 0xD0
    __IO u32 RESERVED20;                                                        ///< Reserved                                       offset: 0xD4
    __IO u32 RESERVED21;                                                        ///< Reserved                                       offset: 0xD8
    __IO u32 RESERVED22;                                                        ///< Reserved                                       offset: 0xDC

